"""
    1 - Получить поручения
    2 - Сформировать бригаду рабочих
    3 - Контроль выполнения задач, выданных рабочим
"""


def receive_task():
    """
    Здесь метод чтения поручения из (assignmets.csv).
    :return:
    """
    return


def create_group_worker():
    """
    Здесь метод формирования бригады из нескольких рабочих и выдачи личных задач в (assignmets.csv).
    :return:
    """
    return


def control_of_result():
    """
    Здесь метод формирования перечня выполненых/ не выполненых задач с указанием исполнителей из (assignmets.csv).
    :return:
    """
    return